In [ ]:
# Este ejemplo se corre con las siguientes versiones
# pd.__version__
# 1.0.2
# sklearn.__version__
# 0.22.1
# matplotlib.__version__
# 3.1.3

# Tratamiento de datos perdidos

In [1]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.read_csv('dataimputar.csv')

In [4]:
df1

     A    B    C          D
0  1.0  NaN  2.0     Curicó
1  0.0  3.0  5.0  Pichilemu
2  1.0  3.5  NaN   Santiago
3  NaN  4.0  6.0   Santiago
4  0.0  2.8  2.0     Chiloé
5  0.0  3.1  3.0     Curicó
6  1.0  5.2  4.0   Santiago
7  0.0  0.0  2.0  Pichilemu
8  1.0  NaN  NaN   Santiago
9  1.0  NaN  2.1   Santiago

In [5]:
df_clean = df1.dropna(axis='rows')
df_clean

     A    B    C          D
1  0.0  3.0  5.0  Pichilemu
4  0.0  2.8  2.0     Chiloé
5  0.0  3.1  3.0     Curicó
6  1.0  5.2  4.0   Santiago
7  0.0  0.0  2.0  Pichilemu

In [6]:
#requiere que una fila tenga al menos N no NaN para sobrevivir.
N = 1
df_clean = df1.dropna(thresh=4, axis='rows')
df_clean

     A    B    C          D
1  0.0  3.0  5.0  Pichilemu
4  0.0  2.8  2.0     Chiloé
5  0.0  3.1  3.0     Curicó
6  1.0  5.2  4.0   Santiago
7  0.0  0.0  2.0  Pichilemu

In [7]:
df_clean = df1.dropna(subset=['A','B'])
df_clean

     A    B    C          D
1  0.0  3.0  5.0  Pichilemu
2  1.0  3.5  NaN   Santiago
4  0.0  2.8  2.0     Chiloé
5  0.0  3.1  3.0     Curicó
6  1.0  5.2  4.0   Santiago
7  0.0  0.0  2.0  Pichilemu

In [ ]:
df1

In [8]:
df1['B'].isnull().sum()

3

In [9]:
for i in df1.columns: 
    print(i+': '+ str(df1[i].isnull().sum()))

A: 1
B: 3
C: 2
D: 0

In [ ]:
df1.fillna(method = "backfill")

In [ ]:
df1.fillna(method = "ffill")

In [ ]:
df1.fillna(method='ffill').fillna(method='bfill')

In [ ]:
df1.fillna(value=df1.mean())